In [23]:
import pandas as pd

In [24]:
df_lab = pd.read_csv('../data/LabCount.csv')

In [25]:
def edit_str(str):
    return int(str.split("-")[0])+1

In [26]:
df_lab.head()

   MemberID Year         DSFS LabCount
0  69258001   Y3  2- 3 months        1
1  10143167   Y1   0- 1 month        2
2   1054357   Y1   0- 1 month        6
3  56583841   Y3  6- 7 months        4
4  70967047   Y2   0- 1 month        2

In [27]:
def count_nulls(df):
    null_counter = df.isnull().sum(axis=0)
    null_counter = null_counter[null_counter > 0]
    null_percent = df.isnull().sum(axis=0) / df.shape[0] * 100
    null_percent = null_percent[null_percent > 0]
    null_df = pd.concat([null_counter,null_percent],axis=1)
    null_df.columns = ['count','percent']
    display(null_df)
    
count_nulls(df_lab)

Empty DataFrame
Columns: [count, percent]
Index: []

In [28]:
df_lab["DSFS"] = df_lab["DSFS"].apply(edit_str)

Thay thế các giá trị của cột DSFS từ string thành interger, lấy số lớn hơn giữa 2 số

In [29]:
def edit_count(str):
    str = str.replace("+","")
    return int(str)

In [30]:
df_lab["LabCount"] = df_lab["LabCount"].apply(edit_count)

In [31]:
df_lab.head()

   MemberID Year  DSFS  LabCount
0  69258001   Y3     3         1
1  10143167   Y1     1         2
2   1054357   Y1     1         6
3  56583841   Y3     7         4
4  70967047   Y2     1         2

Chuyển tất cả giá trị trong cột LabCount và DrugCount thành interger

In [32]:
df_lab.dtypes

MemberID     int64
Year        object
DSFS         int64
LabCount     int64
dtype: object

In [89]:
df_group_lab = df_lab.groupby(['Year','MemberID'])
df_new_lab = df_group_lab.agg({'LabCount': ['sum','count']}).reset_index()
df_new_lab

       Year  MemberID LabCount
                           sum count
0        Y1       210        2     1
1        Y1      3889       10     1
2        Y1     11951        3     1
3        Y1     14661        2     1
4        Y1     14778        2     1
5        Y1     17249        2     1
6        Y1     18190        6     2
7        Y1     18333        6     2
8        Y1     18514        5     1
9        Y1     20072        1     1
10       Y1     20269        4     1
11       Y1     20482       17    10
12       Y1     21207       16     2
13       Y1     23328        4     2
14       Y1     27686        4     1
15       Y1     28243        6     1
16       Y1     32491        9     1
17       Y1     33120       11     3
18       Y1     34208       10     1
19       Y1     34791        3     1
20       Y1     36908        3     1
21       Y1     42216        9     2
22       Y1     43452        4     2
23       Y1     47103        9     1
24       Y1     48929       14     3
25       Y1     49525       11     5
26       Y1     50035       25     7
27       Y1     55259        6     1
28       Y1     58081       37     5
29       Y1     61772        7     3
...     ...       ...      ...   ...
154904   Y3  99943026        7     2
154905   Y3  99944407        4     4
154906   Y3  99945244       13     2
154907   Y3  99946229        2     1
154908   Y3  99950052        7     4
154909   Y3  99950893        3     2
154910   Y3  99951714        6     2
154911   Y3  99954559       11     2
154912   Y3  99956516        2     1
154913   Y3  99959542        5     1
154914   Y3  99960506        9     4
154915   Y3  99962675        8     2
154916   Y3  99963157       10     1
154917   Y3  99963292        1     1
154918   Y3  99963745       17     4
154919   Y3  99965651        9     2
154920   Y3  99967447       15     5
154921   Y3  99967658       19     2
154922   Y3  99969451        3     1
154923   Y3  99971678        4     2
154924   Y3  99973127        1     1
154925   Y3  99973285        1     1
154926   Y3  99974933        8     1
154927   Y3  99975677        1     1
154928   Y3  99977491        1     1
154929   Y3  99982956        1     1
154930   Y3  99987030       10     1
154931   Y3  99992565       10     1
154932   Y3  99993334        3     1
154933   Y3  99995391        8     4

[154934 rows x 4 columns]

In [91]:
df_new_lab.to_csv("new-data/new_labs.csv", index=False)

In [90]:
df_new_lab.loc[(df_new_lab['MemberID']==69258001)]

       Year  MemberID LabCount
                           sum count
36785    Y1  69258001        5     1
88690    Y2  69258001        3     2
139334   Y3  69258001       10     4